Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.2.52/samv70b/xc32/ATSAMV70Q20B/startup_atsamv70q20b.c
#else /* Legacy defined(_SAMV70Q20B_H) */
        /* Configurable interrupts with Legacy names */
        /* .pfnSUPC_Handler         = */ (void*) SUPC_Handler,        /* 0  Supply Controller */
        /* .pfnRSTC_Handler         = */ (void*) RSTC_Handler,        /* 1  Reset Controller */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-time Clock */
        /* .pfnRTT_Handler          = */ (void*) RTT_Handler,         /* 3  Real-time Timer */
        /* .pfnWDT_Handler          = */ (void*) WDT_Handler,         /* 4  Watchdog Timer */
        /* .pfnPMC_Handler          = */ (void*) PMC_Handler,         /* 5  Power Management Controller */
        /* .pfnEFC_Handler          = */ (void*) EFC_Handler,         /* 6  Embedded Flash Controller */
        /* .pfnUART0_Handler        = */ (void*) UART0_Handler,       /* 7  Universal Asynchronous Receiver Transmitter */
        /* .pfnUART1_Handler        = */ (void*) UART1_Handler,       /* 8  Universal Asynchronous Receiver Transmitter */
        /* .pvReserved9             = */ (void*) (0UL),               /* 9  Reserved */
        /* .pfnPIOA_Handler         = */ (void*) PIOA_Handler,        /* 10 Parallel Input/Output Controller */
        /* .pfnPIOB_Handler         = */ (void*) PIOB_Handler,        /* 11 Parallel Input/Output Controller */
        /* .pfnPIOC_Handler         = */ (void*) PIOC_Handler,        /* 12 Parallel Input/Output Controller */
        /* .pfnUSART0_Handler       = */ (void*) USART0_Handler,      /* 13 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pfnUSART1_Handler       = */ (void*) USART1_Handler,      /* 14 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pfnUSART2_Handler       = */ (void*) USART2_Handler,      /* 15 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pfnPIOD_Handler         = */ (void*) PIOD_Handler,        /* 16 Parallel Input/Output Controller */
        /* .pfnPIOE_Handler         = */ (void*) PIOE_Handler,        /* 17 Parallel Input/Output Controller */
        /* .pfnHSMCI_Handler        = */ (void*) HSMCI_Handler,       /* 18 High Speed MultiMedia Card Interface */
        /* .pfnTWIHS0_Handler       = */ (void*) TWIHS0_Handler,      /* 19 Two-wire Interface High Speed */
        /* .pfnTWIHS1_Handler       = */ (void*) TWIHS1_Handler,      /* 20 Two-wire Interface High Speed */
        /* .pfnSPI0_Handler         = */ (void*) SPI0_Handler,        /* 21 Serial Peripheral Interface */
        /* .pfnSSC_Handler          = */ (void*) SSC_Handler,         /* 22 Synchronous Serial Controller */
        /* .pfnTC0_Handler          = */ (void*) TC0_Handler,         /* 23 Timer Counter */
        /* .pfnTC1_Handler          = */ (void*) TC1_Handler,         /* 24 Timer Counter */
        /* .pfnTC2_Handler          = */ (void*) TC2_Handler,         /* 25 Timer Counter */
        /* .pfnTC3_Handler          = */ (void*) TC3_Handler,         /* 26 Timer Counter */
        /* .pfnTC4_Handler          = */ (void*) TC4_Handler,         /* 27 Timer Counter */
        /* .pfnTC5_Handler          = */ (void*) TC5_Handler,         /* 28 Timer Counter */
        /* .pfnAFEC0_Handler        = */ (void*) AFEC0_Handler,       /* 29 Analog Front-End Controller */
        /* .pfnDACC_Handler         = */ (void*) DACC_Handler,        /* 30 Digital-to-Analog Converter Controller */
        /* .pfnPWM0_Handler         = */ (void*) PWM0_Handler,        /* 31 Pulse Width Modulation Controller */
        /* .pfnICM_Handler          = */ (void*) ICM_Handler,         /* 32 Integrity Check Monitor */
        /* .pfnACC_Handler          = */ (void*) ACC_Handler,         /* 33 Analog Comparator Controller */
        /* .pfnUSBHS_Handler        = */ (void*) USBHS_Handler,       /* 34 USB High-Speed Interface */
        /* .pfnMCAN0_INT0_Handler   = */ (void*) MCAN0_INT0_Handler,  /* 35 Controller Area Network */
        /* .pfnMCAN0_INT1_Handler   = */ (void*) MCAN0_INT1_Handler,  /* 36 Controller Area Network */
        /* .pfnMCAN1_INT0_Handler   = */ (void*) MCAN1_INT0_Handler,  /* 37 Controller Area Network */
        /* .pfnMCAN1_INT1_Handler   = */ (void*) MCAN1_INT1_Handler,  /* 38 Controller Area Network */
        /* .pvReserved39            = */ (void*) (0UL),               /* 39 Reserved */
        /* .pfnAFEC1_Handler        = */ (void*) AFEC1_Handler,       /* 40 Analog Front-End Controller */
        /* .pfnTWIHS2_Handler       = */ (void*) TWIHS2_Handler,      /* 41 Two-wire Interface High Speed */
        /* .pfnSPI1_Handler         = */ (void*) SPI1_Handler,        /* 42 Serial Peripheral Interface */
        /* .pfnQSPI_Handler         = */ (void*) QSPI_Handler,        /* 43 Quad Serial Peripheral Interface */
        /* .pfnUART2_Handler        = */ (void*) UART2_Handler,       /* 44 Universal Asynchronous Receiver Transmitter */
        /* .pfnUART3_Handler        = */ (void*) UART3_Handler,       /* 45 Universal Asynchronous Receiver Transmitter */
        /* .pfnUART4_Handler        = */ (void*) UART4_Handler,       /* 46 Universal Asynchronous Receiver Transmitter */
        /* .pfnTC6_Handler          = */ (void*) TC6_Handler,         /* 47 Timer Counter */
        /* .pfnTC7_Handler          = */ (void*) TC7_Handler,         /* 48 Timer Counter */
        /* .pfnTC8_Handler          = */ (void*) TC8_Handler,         /* 49 Timer Counter */
        /* .pfnTC9_Handler          = */ (void*) TC9_Handler,         /* 50 Timer Counter */
        /* .pfnTC10_Handler         = */ (void*) TC10_Handler,        /* 51 Timer Counter */
        /* .pfnTC11_Handler         = */ (void*) TC11_Handler,        /* 52 Timer Counter */
        /* .pfnMLB_Handler          = */ (void*) MLB_Handler,         /* 53 MediaLB */
        /* .pvReserved54            = */ (void*) (0UL),               /* 54 Reserved */
        /* .pvReserved55            = */ (void*) (0UL),               /* 55 Reserved */
        /* .pfnAES_Handler          = */ (void*) AES_Handler,         /* 56 Advanced Encryption Standard */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 57 True Random Number Generator */
        /* .pfnXDMAC_Handler        = */ (void*) XDMAC_Handler,       /* 58 Extensible DMA Controller */
        /* .pfnISI_Handler          = */ (void*) ISI_Handler,         /* 59 Image Sensor Interface */
        /* .pfnPWM1_Handler         = */ (void*) PWM1_Handler,        /* 60 Pulse Width Modulation Controller */
        /* .pfnFPU_Handler          = */ (void*) FPU_Handler,         /* 61 Floating Point Unit */
        /* .pfnSDRAMC_Handler       = */ (void*) SDRAMC_Handler,      /* 62 SDRAM Controller */
        /* .pfnRSWDT_Handler        = */ (void*) RSWDT_Handler,       /* 63 Reinforced Safety Watchdog Timer */
        /* .pfnCCW_Handler          = */ (void*) CCW_Handler,         /* 64 System Control Block */
        /* .pfnCCF_Handler          = */ (void*) CCF_Handler,         /* 65 System Control Block */
        /* .pvReserved66            = */ (void*) (0UL),               /* 66 Reserved */
        /* .pvReserved67            = */ (void*) (0UL),               /* 67 Reserved */
        /* .pfnIXC_Handler          = */ (void*) IXC_Handler,         /* 68 Floating Point Unit */
        /* .pfnI2SC0_Handler        = */ (void*) I2SC0_Handler,       /* 69 Inter-IC Sound Controller */
        /* .pfnI2SC1_Handler        = */ (void*) I2SC1_Handler        /* 70 Inter-IC Sound Controller */
#endif
};

#if (__ARM_FP==14) || (__ARM_FP==4)
/* These functions are used only when compiling with -mfloat-abi=softfp or -mfloat-abi=hard */
/* Save and restore IRQs */
typedef uint32_t irqflags_t;
static bool g_interrupt_enabled;
#define cpu_irq_is_enabled()    (__get_PRIMASK() == 0)
#  define cpu_irq_enable()                             \
        do {                                           \
                g_interrupt_enabled = true;            \
                __DMB();                               \
                __enable_irq();                        \
        } while (0)
#  define cpu_irq_disable()                            \
        do {                                           \
                __disable_irq();                       \
                __DMB();                               \
                g_interrupt_enabled = false;           \
        } while (0)
__always_inline __STATIC_INLINE bool __attribute__((optimize("-O1"))) cpu_irq_is_enabled_flags(irqflags_t flags)
{
        return (flags);
}
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) cpu_irq_restore(irqflags_t flags)
{
        if (cpu_irq_is_enabled_flags(flags))
                cpu_irq_enable();
}
__always_inline __STATIC_INLINE __attribute__((optimize("-O1"))) irqflags_t cpu_irq_save(void)
{
        volatile irqflags_t flags = cpu_irq_is_enabled();
        cpu_irq_disable();
        return flags;
}

/** Address for ARM CPACR */
#define ADDR_CPACR 0xE000ED88
/** CPACR Register */
#define REG_CPACR  (*((volatile uint32_t *)ADDR_CPACR))

/**
* \brief Enable FPU
*/
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) fpu_enable(void)
{
    irqflags_t flags;
    flags = cpu_irq_save();
    REG_CPACR |=  (0xFu << 20);
    __DSB();
    __ISB();
    cpu_irq_restore(flags);
}
#endif /* (__ARM_FP==14) || (__ARM_FP==4) */
 
